Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.CanAddEntry(Autodesk.Revit.DB.KeyBasedTreeEntry)
Verifies if the KeyBasedTreeEntry could be added in this KeyBasedTreeEntriesLoadContent.
entry:
The KeyBasedTreeEntry object to be checked.
Returns:
True if the KeyBasedTreeEntry could be added in, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.IsEntriesBuilt(Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent)
Verifies that the KeyBasedTreeEntries object owned by a KeyBasedTreeEntriesLoadContent object is built.
content:
The KeyBasedTreeEntriesLoadContent object to be checked.
Returns:
True if the KeyBasedTreeEntries object is built already, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.AddEntry(Autodesk.Revit.DB.KeyBasedTreeEntry)
Adds one KeyBasedTreeEntry to this KeyBasedTreeEntriesLoadContent, which is used to build a KeyBasedTreeEntries object by BuildEntries function.
Remarks:
The entry will not be added if it is invalid or duplicate with the added entries.
entry:
The entry to be added.
Returns:
Returns true if an entry is added into the entry data set successfully,
returns false if an entry fails to be added because this entry is invalid or a duplicate
of one in the entry data set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The KeyBasedTreeEntry object is not appropriate to be added in this KeyBasedTreeEntriesLoadContent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is built already.
Adding more KeyBasedTreeEntries as well as repeated building, is not supported.
Since:
2015